<details><summary>plan for dev-vpc 2024-06-05 16:19:57 (UTC)</summary>
      <details><summary>Locking successful</summary>
  Project diggerhq/demo-ee-features#dev-vpc has been locked by PR #6
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_ssm_parameter.foo will be created
  + resource "aws_ssm_parameter" "foo" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dev/vpc"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details><summary>Terraform plan validation check (dev-vpc)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>